trv/CL_H100_FW/H100/Lib/mc9s08mp16.c
/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile ADCRSTR _ADCR;                                    /* Data Result Register; 0x00000012 */
volatile ADCCVSTR _ADCCV;                                  /* Compare Value Register; 0x00000014 */
volatile IICSLTSTR _IICSLT;                                /* IIC SCL Low Time Out register; 0x00000028 */
volatile FTM1CNTSTR _FTM1CNT;                              /* FTM1 Timer Counter Register; 0x00000031 */
volatile FTM1MODSTR _FTM1MOD;                              /* FTM1 Timer Counter Modulo Register; 0x00000033 */
volatile FTM1C0VSTR _FTM1C0V;                              /* FTM1 Timer Channel 0 Value Register; 0x00000036 */
volatile FTM1C1VSTR _FTM1C1V;                              /* FTM1 Timer Channel 1 Value Register; 0x00000039 */
volatile FTM1CNTINSTR _FTM1CNTIN;                          /* FTM1 Counter Initial Value Registers; 0x00000040 */
volatile SCIBDSTR _SCIBD;                                  /* SCI Baud Rate Register; 0x00000068 */
volatile PDB1DLYASTR _PDB1DLYA;                            /* PDB1 Delay A Register; 0x00000072 */
volatile PDB1DLYBSTR _PDB1DLYB;                            /* PDB1 Delay B Register; 0x00000074 */
volatile PDB1MODSTR _PDB1MOD;                              /* PDB1 Counter Modulus Register; 0x00000076 */
volatile PDB1CNTSTR _PDB1CNT;                              /* PDB1 Counter Value Register; 0x00000078 */
volatile PDB2DLYASTR _PDB2DLYA;                            /* PDB2 Delay A Register; 0x00000082 */
volatile PDB2DLYBSTR _PDB2DLYB;                            /* PDB2 Delay B Register; 0x00000084 */
volatile PDB2MODSTR _PDB2MOD;                              /* PDB2 Counter Modulus Register; 0x00000086 */
volatile PDB2CNTSTR _PDB2CNT;                              /* PDB2 Counter Value Register; 0x00000088 */
volatile SDIDSTR _SDID;                                    /* System Device Identification Register; 0x00001806 */
volatile DBGCASTR _DBGCA;                                  /* Debug Comparator A Register; 0x00001810 */
volatile DBGCBSTR _DBGCB;                                  /* Debug Comparator B Register; 0x00001812 */
volatile DBGCCSTR _DBGCC;                                  /* Debug Comparator C Register; 0x00001814 */
volatile DBGFSTR _DBGF;                                    /* Debug FIFO Register; 0x00001816 */
volatile FTM2CNTSTR _FTM2CNT;                              /* FTM2 Timer Counter Register; 0x00001881 */
volatile FTM2MODSTR _FTM2MOD;                              /* FTM2 Timer Counter Modulo Register; 0x00001883 */
volatile FTM2C0VSTR _FTM2C0V;                              /* FTM2 Timer Channel 0 Value Register; 0x00001886 */
volatile FTM2C1VSTR _FTM2C1V;                              /* FTM2 Timer Channel 1 Value Register; 0x00001889 */
volatile FTM2C2VSTR _FTM2C2V;                              /* FTM2 Timer Channel 2 Value Register; 0x0000188C */
volatile FTM2C3VSTR _FTM2C3V;                              /* FTM2 Timer Channel 3 Value Register; 0x0000188F */
volatile FTM2C4VSTR _FTM2C4V;                              /* FTM2 Timer Channel 4 Value Register; 0x00001892 */
volatile FTM2C5VSTR _FTM2C5V;                              /* FTM2 Timer Channel 5 Value Register; 0x00001895 */
volatile FTM2CNTINSTR _FTM2CNTIN;                          /* FTM2 Counter Initial Value Registers; 0x000018A0 */

/*lint -restore */

/* EOF */
